{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "94acfab1-26df-4a0e-9de2-7f6bbce05b66",
   "metadata": {},
   "outputs": [],
   "source": [
    "# pip install sql-metadata"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "id": "45844e33-2cb8-4713-8901-3d28a4545c44",
   "metadata": {},
   "outputs": [],
   "source": [
    "import pandas as pd\n",
    "import warnings; warnings.filterwarnings('ignore')\n",
    "from sql_metadata import Parser\n",
    "import psycopg2\n",
    "import psycopg2.extras"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "id": "65ccdca5-ccac-42c2-aacb-993ad6bb58e1",
   "metadata": {},
   "outputs": [],
   "source": [
    "conn = psycopg2.connect(\"dbname=dvdrental host='192.168.16.16' user='ags14' port=5430 password='bitnine123!'\")\n",
    "conn.autocommit = True\n",
    "cursor = conn.cursor(cursor_factory=psycopg2.extras.RealDictCursor)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 40,
   "id": "360a4910-f725-422c-bdbe-d13fefda7c94",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "'category, film_category, film'"
      ]
     },
     "execution_count": 40,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# # extract raw sql-metadata tokens\n",
    "# tables = Parser(\"\"\"\n",
    "# SELECT category.name, AVG(film.rental_rate) AS average_rental_rate\n",
    "# FROM category\n",
    "# JOIN film_category ON category.category_id = film_category.category_id\n",
    "# JOIN film ON film_category.film_id = film.film_id\n",
    "# GROUP BY category.name;\n",
    "# \"\"\").tables\n",
    "# (\", \").join(tables)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "id": "0e9dde5d-df61-45a7-9f60-f204ea36b293",
   "metadata": {},
   "outputs": [],
   "source": [
    "# (\", \").join(tables)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "id": "761bc5a6-1733-4672-bc03-7a38bce744f2",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>query</th>\n",
       "      <th>action</th>\n",
       "      <th>detail</th>\n",
       "      <th>ref</th>\n",
       "      <th>쿼리\\n작동 여부</th>\n",
       "      <th>쿼리 적합성</th>\n",
       "      <th>쿼리 처리 소요시간(ms)\\n(최적화 전)</th>\n",
       "      <th>쿼리 처리 소요시간(ms)\\n(최적화 후)</th>\n",
       "      <th>비고</th>\n",
       "      <th>Unnamed: 9</th>\n",
       "      <th>Unnamed: 10</th>\n",
       "      <th>최적화 전</th>\n",
       "      <th>최적화 후</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>SELECT customer_id, COUNT(rental_id) AS total_...</td>\n",
       "      <td>고객별 총 대여 횟수 조회</td>\n",
       "      <td>rental 테이블에서 고객별로 rental_id를 카운트</td>\n",
       "      <td>rental</td>\n",
       "      <td>O</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>-</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>쿼리 처리 소요시간 평균(ms)</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>SELECT inventory.film_id, AVG(return_date - re...</td>\n",
       "      <td>각 영화의 평균 대여 기간 계산</td>\n",
       "      <td>rental 테이블과 inventory 테이블을 조인하여 영화별로 대여 기간의 평균...</td>\n",
       "      <td>rental, inventory</td>\n",
       "      <td>O</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>-</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>SELECT customer_id, genre, MAX(genre_count) AS...</td>\n",
       "      <td>각 고객별로 가장 많이 대여한 장르 조회</td>\n",
       "      <td>RANK() 함수로 각 고객별로 장르 대여 횟수에 따라 순위를 매김.  PARTIT...</td>\n",
       "      <td>rental, inventory, film_category, category</td>\n",
       "      <td>O</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>-</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>SELECT EXTRACT(YEAR FROM rental_date) AS renta...</td>\n",
       "      <td>모든 고객의 대여 기록이 있는 월별 대여 횟수</td>\n",
       "      <td>rental 테이블에서 연도와 월을 추출하여 그 기간 동안의 총 대여 횟수를 집계</td>\n",
       "      <td>rental</td>\n",
       "      <td>O</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>-</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>SELECT film.film_id, title, SUM(amount) AS tot...</td>\n",
       "      <td>각 영화에 대한 총 수익 조회\\n\\n</td>\n",
       "      <td>payment, rental, inventory, film 테이블을 조인하여 각 영...</td>\n",
       "      <td>payment, rental, inventory, film</td>\n",
       "      <td>O</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>-</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                                               query  \\\n",
       "0  SELECT customer_id, COUNT(rental_id) AS total_...   \n",
       "1  SELECT inventory.film_id, AVG(return_date - re...   \n",
       "2  SELECT customer_id, genre, MAX(genre_count) AS...   \n",
       "3  SELECT EXTRACT(YEAR FROM rental_date) AS renta...   \n",
       "4  SELECT film.film_id, title, SUM(amount) AS tot...   \n",
       "\n",
       "                      action  \\\n",
       "0             고객별 총 대여 횟수 조회   \n",
       "1          각 영화의 평균 대여 기간 계산   \n",
       "2     각 고객별로 가장 많이 대여한 장르 조회   \n",
       "3  모든 고객의 대여 기록이 있는 월별 대여 횟수   \n",
       "4       각 영화에 대한 총 수익 조회\\n\\n   \n",
       "\n",
       "                                              detail  \\\n",
       "0                   rental 테이블에서 고객별로 rental_id를 카운트   \n",
       "1  rental 테이블과 inventory 테이블을 조인하여 영화별로 대여 기간의 평균...   \n",
       "2  RANK() 함수로 각 고객별로 장르 대여 횟수에 따라 순위를 매김.  PARTIT...   \n",
       "3      rental 테이블에서 연도와 월을 추출하여 그 기간 동안의 총 대여 횟수를 집계   \n",
       "4  payment, rental, inventory, film 테이블을 조인하여 각 영...   \n",
       "\n",
       "                                          ref 쿼리\\n작동 여부  쿼리 적합성  \\\n",
       "0                                      rental         O     NaN   \n",
       "1                           rental, inventory         O     NaN   \n",
       "2  rental, inventory, film_category, category         O     NaN   \n",
       "3                                      rental         O     NaN   \n",
       "4            payment, rental, inventory, film         O     NaN   \n",
       "\n",
       "   쿼리 처리 소요시간(ms)\\n(최적화 전) 쿼리 처리 소요시간(ms)\\n(최적화 후)   비고  Unnamed: 9  \\\n",
       "0                      NaN                       -  NaN         NaN   \n",
       "1                      NaN                       -  NaN         NaN   \n",
       "2                      NaN                       -  NaN         NaN   \n",
       "3                      NaN                       -  NaN         NaN   \n",
       "4                      NaN                       -  NaN         NaN   \n",
       "\n",
       "         Unnamed: 10  최적화 전  최적화 후  \n",
       "0  쿼리 처리 소요시간 평균(ms)    NaN    NaN  \n",
       "1                NaN    NaN    NaN  \n",
       "2                NaN    NaN    NaN  \n",
       "3                NaN    NaN    NaN  \n",
       "4                NaN    NaN    NaN  "
      ]
     },
     "execution_count": 5,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "data = pd.read_csv('SQL_querylogs_dataset - dvdrental.csv')\n",
    "data.head()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "id": "22a679df-cc54-4e62-851c-e3a2dbb52114",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>0</th>\n",
       "      <th>1</th>\n",
       "      <th>2</th>\n",
       "      <th>3</th>\n",
       "      <th>4</th>\n",
       "      <th>5</th>\n",
       "      <th>6</th>\n",
       "      <th>7</th>\n",
       "      <th>8</th>\n",
       "      <th>9</th>\n",
       "      <th>...</th>\n",
       "      <th>20</th>\n",
       "      <th>21</th>\n",
       "      <th>22</th>\n",
       "      <th>23</th>\n",
       "      <th>24</th>\n",
       "      <th>25</th>\n",
       "      <th>26</th>\n",
       "      <th>27</th>\n",
       "      <th>28</th>\n",
       "      <th>29</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>2024-04-13 16:04:46.112 KST</td>\n",
       "      <td>ags14</td>\n",
       "      <td>dvdrental</td>\n",
       "      <td>40580</td>\n",
       "      <td>192.168.16.16:38676</td>\n",
       "      <td>661a2df4.9e84</td>\n",
       "      <td>1</td>\n",
       "      <td>SELECT</td>\n",
       "      <td>2024-04-13 16:02:12 KST</td>\n",
       "      <td>3/330</td>\n",
       "      <td>...</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>READ</td>\n",
       "      <td>NaN</td>\n",
       "      <td>statement</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>2024-04-13 16:04:46.112 KST</td>\n",
       "      <td>ags14</td>\n",
       "      <td>dvdrental</td>\n",
       "      <td>40580</td>\n",
       "      <td>192.168.16.16:38676</td>\n",
       "      <td>661a2df4.9e84</td>\n",
       "      <td>2</td>\n",
       "      <td>SELECT</td>\n",
       "      <td>2024-04-13 16:02:12 KST</td>\n",
       "      <td>3/331</td>\n",
       "      <td>...</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>READ</td>\n",
       "      <td>NaN</td>\n",
       "      <td>statement</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>2024-04-13 16:04:46.112 KST</td>\n",
       "      <td>ags14</td>\n",
       "      <td>dvdrental</td>\n",
       "      <td>40580</td>\n",
       "      <td>192.168.16.16:38676</td>\n",
       "      <td>661a2df4.9e84</td>\n",
       "      <td>3</td>\n",
       "      <td>SELECT</td>\n",
       "      <td>2024-04-13 16:02:12 KST</td>\n",
       "      <td>3/332</td>\n",
       "      <td>...</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>READ</td>\n",
       "      <td>NaN</td>\n",
       "      <td>statement</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>2024-04-13 16:04:46.112 KST</td>\n",
       "      <td>ags14</td>\n",
       "      <td>dvdrental</td>\n",
       "      <td>40580</td>\n",
       "      <td>192.168.16.16:38676</td>\n",
       "      <td>661a2df4.9e84</td>\n",
       "      <td>4</td>\n",
       "      <td>SELECT</td>\n",
       "      <td>2024-04-13 16:02:12 KST</td>\n",
       "      <td>3/333</td>\n",
       "      <td>...</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>READ</td>\n",
       "      <td>NaN</td>\n",
       "      <td>statement</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>2024-04-13 16:04:46.112 KST</td>\n",
       "      <td>ags14</td>\n",
       "      <td>dvdrental</td>\n",
       "      <td>40580</td>\n",
       "      <td>192.168.16.16:38676</td>\n",
       "      <td>661a2df4.9e84</td>\n",
       "      <td>5</td>\n",
       "      <td>SELECT</td>\n",
       "      <td>2024-04-13 16:02:12 KST</td>\n",
       "      <td>3/334</td>\n",
       "      <td>...</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>READ</td>\n",
       "      <td>NaN</td>\n",
       "      <td>statement</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>5 rows × 30 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "                            0      1          2      3                    4   \\\n",
       "0  2024-04-13 16:04:46.112 KST  ags14  dvdrental  40580  192.168.16.16:38676   \n",
       "1  2024-04-13 16:04:46.112 KST  ags14  dvdrental  40580  192.168.16.16:38676   \n",
       "2  2024-04-13 16:04:46.112 KST  ags14  dvdrental  40580  192.168.16.16:38676   \n",
       "3  2024-04-13 16:04:46.112 KST  ags14  dvdrental  40580  192.168.16.16:38676   \n",
       "4  2024-04-13 16:04:46.112 KST  ags14  dvdrental  40580  192.168.16.16:38676   \n",
       "\n",
       "              5   6       7                        8      9   ...  20  21  22  \\\n",
       "0  661a2df4.9e84   1  SELECT  2024-04-13 16:02:12 KST  3/330  ... NaN NaN NaN   \n",
       "1  661a2df4.9e84   2  SELECT  2024-04-13 16:02:12 KST  3/331  ... NaN NaN NaN   \n",
       "2  661a2df4.9e84   3  SELECT  2024-04-13 16:02:12 KST  3/332  ... NaN NaN NaN   \n",
       "3  661a2df4.9e84   4  SELECT  2024-04-13 16:02:12 KST  3/333  ... NaN NaN NaN   \n",
       "4  661a2df4.9e84   5  SELECT  2024-04-13 16:02:12 KST  3/334  ... NaN NaN NaN   \n",
       "\n",
       "   23  24  25  26    27  28         29  \n",
       "0 NaN NaN NaN NaN  READ NaN  statement  \n",
       "1 NaN NaN NaN NaN  READ NaN  statement  \n",
       "2 NaN NaN NaN NaN  READ NaN  statement  \n",
       "3 NaN NaN NaN NaN  READ NaN  statement  \n",
       "4 NaN NaN NaN NaN  READ NaN  statement  \n",
       "\n",
       "[5 rows x 30 columns]"
      ]
     },
     "execution_count": 6,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "sample_audit = pd.read_csv('sample_agaudit-2024-04-13-16-00-00.csv', header=None)\n",
    "sample_audit.head()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "0f97668f-7620-41e1-ba5b-80f2a6a93c32",
   "metadata": {},
   "outputs": [],
   "source": [
    "def trim(query):\n",
    "    return query.replace('\"',\" \").replace(\"\\n\",\" \").strip()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 20,
   "id": "edb7fa16-342b-42e3-b67b-95ddb739849c",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "['SELECT customer_id, COUNT(rental_id) AS total_rentals FROM rental GROUP BY customer_id;',\n",
       " 'SELECT inventory.film_id, AVG(return_date - rental_date) AS average_rental_duration FROM rental JOIN inventory ON rental.inventory_id = inventory.inventory_id GROUP BY inventory.film_id;',\n",
       " 'WITH GenreCounts AS (   SELECT      rental.customer_id,      category.name AS genre,      COUNT(*) AS genre_count,     MAX(COUNT(*)) OVER (PARTITION BY rental.customer_id) AS max_genre_count   FROM rental   JOIN inventory ON rental.inventory_id = inventory.inventory_id   JOIN film_category ON inventory.film_id = film_category.film_id   JOIN category ON film_category.category_id = category.category_id   GROUP BY rental.customer_id, category.name ) SELECT    customer_id,    genre,    genre_count AS max_genre_count FROM GenreCounts WHERE genre_count = max_genre_count;',\n",
       " 'SELECT EXTRACT(YEAR FROM rental_date) AS rental_year, EXTRACT(MONTH FROM rental_date) AS rental_month, COUNT(rental_id) AS total_rentals FROM rental GROUP BY rental_year, rental_month;',\n",
       " 'SELECT film.film_id, title, SUM(amount) AS total_revenue FROM payment JOIN rental ON payment.rental_id = rental.rental_id JOIN inventory ON rental.inventory_id = inventory.inventory_id JOIN film ON inventory.film_id = film.film_id GROUP BY film.film_id, title;']"
      ]
     },
     "execution_count": 20,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "queries = [trim(i) for i in sample_audit[13]]\n",
    "queries[:5]"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 21,
   "id": "674be526-8fc9-40ed-bd8d-25ff36e14055",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[['rental'],\n",
       " ['rental', 'inventory'],\n",
       " ['rental', 'inventory', 'film_category', 'category'],\n",
       " ['rental'],\n",
       " ['payment', 'rental', 'inventory', 'film']]"
      ]
     },
     "execution_count": 21,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "cooc_tables = []\n",
    "for i in queries:\n",
    "    tables = Parser(f\"\"\"{i}\"\"\").tables\n",
    "    cooc_tables.append(tables)\n",
    "cooc_tables[:5]"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 156,
   "id": "b90b710f-94ee-4751-93f1-b512f5b5fb1f",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "101"
      ]
     },
     "execution_count": 156,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "len(cooc_tables)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 159,
   "id": "dc5f39a6-a03d-4171-a1c3-18f8f75ace24",
   "metadata": {},
   "outputs": [],
   "source": [
    "cursor.execute(f\"\"\"\n",
    "                SET search_path TO ag_catalog;\n",
    "                \"\"\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 162,
   "id": "8a72caac-7d0d-4a46-8f16-8edcf0eddf55",
   "metadata": {},
   "outputs": [],
   "source": [
    "def update_edge_count(table1, table2):\n",
    "    cursor.execute(f\"\"\"\n",
    "                  SELECT * FROM cypher('graph_v2',$$\n",
    "                  MATCH (v1:table {{ table_name:'{table1}' }})-[r]-(v2:table {{ table_name:'{table2}' }})\n",
    "                  SET r.count = r.count + 1\n",
    "                  RETURN r.count \n",
    "                  $$) as (count agtype);\n",
    "                  \"\"\")\n",
    "    updated_count = int(cursor.fetchall()[0]['count'])\n",
    "    print(f'edge count between {table1} and {table2} has been updated from {updated_count-1} to {updated_count}')"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 163,
   "id": "68410374-8834-4cb2-af25-a1cbc493473f",
   "metadata": {
    "scrolled": true
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "query 0\n",
      "No relation are found\n",
      "\n",
      "query 1\n",
      "num_relation: 1\n",
      "\n",
      "joined tables: rental, inventory\n",
      "edge count between rental and inventory has been updated from 2 to 3\n",
      "\n",
      "query 2\n",
      "num_relation: 3\n",
      "\n",
      "joined tables: rental, inventory\n",
      "edge count between rental and inventory has been updated from 3 to 4\n",
      "\n",
      "joined tables: inventory, film_category\n",
      "\n",
      "query 3\n",
      "No relation are found\n",
      "\n",
      "query 4\n",
      "num_relation: 3\n",
      "\n",
      "joined tables: payment, rental\n",
      "edge count between payment and rental has been updated from 0 to 1\n",
      "\n",
      "joined tables: rental, inventory\n",
      "edge count between rental and inventory has been updated from 4 to 5\n",
      "\n",
      "joined tables: inventory, film\n",
      "edge count between inventory and film has been updated from 0 to 1\n",
      "\n",
      "query 5\n",
      "num_relation: 2\n",
      "\n",
      "joined tables: rental, inventory\n",
      "edge count between rental and inventory has been updated from 5 to 6\n",
      "\n",
      "joined tables: inventory, film\n",
      "edge count between inventory and film has been updated from 1 to 2\n",
      "\n",
      "query 6\n",
      "num_relation: 3\n",
      "\n",
      "joined tables: film, inventory\n",
      "edge count between film and inventory has been updated from 2 to 3\n",
      "\n",
      "joined tables: inventory, rental\n",
      "edge count between inventory and rental has been updated from 6 to 7\n",
      "\n",
      "joined tables: rental, payment\n",
      "edge count between rental and payment has been updated from 1 to 2\n",
      "\n",
      "query 7\n",
      "No relation are found\n",
      "\n",
      "query 8\n",
      "num_relation: 3\n",
      "\n",
      "joined tables: rental, inventory\n",
      "edge count between rental and inventory has been updated from 7 to 8\n",
      "\n",
      "joined tables: inventory, film_category\n",
      "\n",
      "query 9\n",
      "num_relation: 1\n",
      "\n",
      "joined tables: rental, staff\n",
      "edge count between rental and staff has been updated from 0 to 1\n",
      "\n",
      "query 10\n",
      "num_relation: 2\n",
      "\n",
      "joined tables: payment, staff\n",
      "edge count between payment and staff has been updated from 0 to 1\n",
      "\n",
      "joined tables: staff, store\n",
      "edge count between staff and store has been updated from 0 to 1\n",
      "\n",
      "query 11\n",
      "num_relation: 3\n",
      "\n",
      "joined tables: rental, inventory\n",
      "edge count between rental and inventory has been updated from 8 to 9\n",
      "\n",
      "joined tables: inventory, film_actor\n",
      "\n",
      "query 12\n",
      "num_relation: 2\n",
      "\n",
      "joined tables: rental, inventory\n",
      "edge count between rental and inventory has been updated from 9 to 10\n",
      "\n",
      "joined tables: inventory, film\n",
      "edge count between inventory and film has been updated from 3 to 4\n",
      "\n",
      "query 13\n",
      "num_relation: 4\n",
      "\n",
      "joined tables: rental, inventory\n",
      "edge count between rental and inventory has been updated from 10 to 11\n",
      "\n",
      "joined tables: inventory, film\n",
      "edge count between inventory and film has been updated from 4 to 5\n",
      "\n",
      "joined tables: film, film_category\n",
      "edge count between film and film_category has been updated from 0 to 1\n",
      "\n",
      "joined tables: film_category, category\n",
      "edge count between film_category and category has been updated from 0 to 1\n",
      "\n",
      "query 14\n",
      "num_relation: 2\n",
      "\n",
      "joined tables: rental, inventory\n",
      "edge count between rental and inventory has been updated from 11 to 12\n",
      "\n",
      "joined tables: inventory, film\n",
      "edge count between inventory and film has been updated from 5 to 6\n",
      "\n",
      "query 15\n",
      "num_relation: 2\n",
      "\n",
      "joined tables: category, film_category\n",
      "edge count between category and film_category has been updated from 1 to 2\n",
      "\n",
      "joined tables: film_category, film\n",
      "edge count between film_category and film has been updated from 1 to 2\n",
      "\n",
      "query 16\n",
      "num_relation: 2\n",
      "\n",
      "joined tables: rental, inventory\n",
      "edge count between rental and inventory has been updated from 12 to 13\n",
      "\n",
      "joined tables: inventory, film\n",
      "edge count between inventory and film has been updated from 6 to 7\n",
      "\n",
      "query 17\n",
      "num_relation: 2\n",
      "\n",
      "joined tables: film, film_category\n",
      "edge count between film and film_category has been updated from 2 to 3\n",
      "\n",
      "joined tables: film_category, category\n",
      "edge count between film_category and category has been updated from 2 to 3\n",
      "\n",
      "query 18\n",
      "num_relation: 1\n",
      "\n",
      "joined tables: rental, inventory\n",
      "edge count between rental and inventory has been updated from 13 to 14\n",
      "\n",
      "query 19\n",
      "num_relation: 3\n",
      "\n",
      "joined tables: film, inventory\n",
      "edge count between film and inventory has been updated from 7 to 8\n",
      "\n",
      "joined tables: inventory, rental\n",
      "edge count between inventory and rental has been updated from 14 to 15\n",
      "\n",
      "joined tables: rental, payment\n",
      "edge count between rental and payment has been updated from 2 to 3\n",
      "\n",
      "query 20\n",
      "No relation are found\n",
      "\n",
      "query 21\n",
      "num_relation: 2\n",
      "\n",
      "joined tables: store, inventory\n",
      "\n",
      "query 22\n",
      "num_relation: 1\n",
      "\n",
      "joined tables: actor, film_actor\n",
      "edge count between actor and film_actor has been updated from 0 to 1\n",
      "\n",
      "query 23\n",
      "num_relation: 2\n",
      "\n",
      "joined tables: film, inventory\n",
      "edge count between film and inventory has been updated from 8 to 9\n",
      "\n",
      "joined tables: inventory, rental\n",
      "edge count between inventory and rental has been updated from 15 to 16\n",
      "\n",
      "query 24\n",
      "No relation are found\n",
      "\n",
      "query 25\n",
      "num_relation: 2\n",
      "\n",
      "joined tables: actor, film_actor\n",
      "edge count between actor and film_actor has been updated from 1 to 2\n",
      "\n",
      "joined tables: film_actor, film\n",
      "edge count between film_actor and film has been updated from 0 to 1\n",
      "\n",
      "query 26\n",
      "num_relation: 2\n",
      "\n",
      "joined tables: rental, inventory\n",
      "edge count between rental and inventory has been updated from 16 to 17\n",
      "\n",
      "joined tables: inventory, film\n",
      "edge count between inventory and film has been updated from 9 to 10\n",
      "\n",
      "query 27\n",
      "num_relation: 4\n",
      "\n",
      "joined tables: category, film_category\n",
      "edge count between category and film_category has been updated from 3 to 4\n",
      "\n",
      "joined tables: film_category, film\n",
      "edge count between film_category and film has been updated from 3 to 4\n",
      "\n",
      "joined tables: film, inventory\n",
      "edge count between film and inventory has been updated from 10 to 11\n",
      "\n",
      "joined tables: inventory, rental\n",
      "edge count between inventory and rental has been updated from 17 to 18\n",
      "\n",
      "query 28\n",
      "num_relation: 5\n",
      "\n",
      "joined tables: rental, inventory\n",
      "edge count between rental and inventory has been updated from 18 to 19\n",
      "\n",
      "joined tables: inventory, film\n",
      "edge count between inventory and film has been updated from 11 to 12\n",
      "\n",
      "joined tables: film, film_category\n",
      "edge count between film and film_category has been updated from 4 to 5\n",
      "\n",
      "joined tables: film_category, category\n",
      "edge count between film_category and category has been updated from 4 to 5\n",
      "\n",
      "joined tables: category, customer\n",
      "\n",
      "query 29\n",
      "num_relation: 2\n",
      "\n",
      "joined tables: actor, film_actor\n",
      "edge count between actor and film_actor has been updated from 2 to 3\n",
      "\n",
      "joined tables: film_actor, film\n",
      "edge count between film_actor and film has been updated from 1 to 2\n",
      "\n",
      "query 30\n",
      "num_relation: 2\n",
      "\n",
      "joined tables: store, staff\n",
      "edge count between store and staff has been updated from 1 to 2\n",
      "\n",
      "joined tables: staff, payment\n",
      "edge count between staff and payment has been updated from 1 to 2\n",
      "\n",
      "query 31\n",
      "num_relation: 1\n",
      "\n",
      "joined tables: customer, rental\n",
      "edge count between customer and rental has been updated from 0 to 1\n",
      "\n",
      "query 32\n",
      "num_relation: 4\n",
      "\n",
      "joined tables: category, film_category\n",
      "edge count between category and film_category has been updated from 5 to 6\n",
      "\n",
      "joined tables: film_category, film\n",
      "edge count between film_category and film has been updated from 5 to 6\n",
      "\n",
      "joined tables: film, inventory\n",
      "edge count between film and inventory has been updated from 12 to 13\n",
      "\n",
      "joined tables: inventory, rental\n",
      "edge count between inventory and rental has been updated from 19 to 20\n",
      "\n",
      "query 33\n",
      "num_relation: 2\n",
      "\n",
      "joined tables: film, inventory\n",
      "edge count between film and inventory has been updated from 13 to 14\n",
      "\n",
      "joined tables: inventory, rental\n",
      "edge count between inventory and rental has been updated from 20 to 21\n",
      "\n",
      "query 34\n",
      "num_relation: 1\n",
      "\n",
      "joined tables: customer, payment\n",
      "edge count between customer and payment has been updated from 0 to 1\n",
      "\n",
      "query 35\n",
      "num_relation: 1\n",
      "\n",
      "joined tables: actor, film_actor\n",
      "edge count between actor and film_actor has been updated from 3 to 4\n",
      "\n",
      "query 36\n",
      "num_relation: 2\n",
      "\n",
      "joined tables: actor, film_actor\n",
      "edge count between actor and film_actor has been updated from 4 to 5\n",
      "\n",
      "joined tables: film_actor, film\n",
      "edge count between film_actor and film has been updated from 2 to 3\n",
      "\n",
      "query 37\n",
      "num_relation: 2\n",
      "\n",
      "joined tables: customer, address\n",
      "edge count between customer and address has been updated from 0 to 1\n",
      "\n",
      "joined tables: address, city\n",
      "edge count between address and city has been updated from 0 to 1\n",
      "\n",
      "query 38\n",
      "num_relation: 2\n",
      "\n",
      "joined tables: customer, address\n",
      "edge count between customer and address has been updated from 1 to 2\n",
      "\n",
      "joined tables: address, city\n",
      "edge count between address and city has been updated from 1 to 2\n",
      "\n",
      "query 39\n",
      "No relation are found\n",
      "\n",
      "query 40\n",
      "num_relation: 3\n",
      "\n",
      "joined tables: customer, rental\n",
      "edge count between customer and rental has been updated from 1 to 2\n",
      "\n",
      "joined tables: rental, inventory\n",
      "edge count between rental and inventory has been updated from 21 to 22\n",
      "\n",
      "joined tables: inventory, film\n",
      "edge count between inventory and film has been updated from 14 to 15\n",
      "\n",
      "query 41\n",
      "num_relation: 2\n",
      "\n",
      "joined tables: film, film_actor\n",
      "edge count between film and film_actor has been updated from 3 to 4\n",
      "\n",
      "joined tables: film_actor, actor\n",
      "edge count between film_actor and actor has been updated from 5 to 6\n",
      "\n",
      "query 42\n",
      "num_relation: 4\n",
      "\n",
      "joined tables: category, film_category\n",
      "edge count between category and film_category has been updated from 6 to 7\n",
      "\n",
      "joined tables: film_category, film\n",
      "edge count between film_category and film has been updated from 6 to 7\n",
      "\n",
      "joined tables: film, inventory\n",
      "edge count between film and inventory has been updated from 15 to 16\n",
      "\n",
      "joined tables: inventory, rental\n",
      "edge count between inventory and rental has been updated from 22 to 23\n",
      "\n",
      "query 43\n",
      "No relation are found\n",
      "\n",
      "query 44\n",
      "num_relation: 1\n",
      "\n",
      "joined tables: staff, payment\n",
      "edge count between staff and payment has been updated from 2 to 3\n",
      "\n",
      "query 45\n",
      "num_relation: 3\n",
      "\n",
      "joined tables: rental, customer\n",
      "edge count between rental and customer has been updated from 2 to 3\n",
      "\n",
      "joined tables: customer, inventory\n",
      "\n",
      "query 46\n",
      "num_relation: 1\n",
      "\n",
      "joined tables: customer, rental\n",
      "edge count between customer and rental has been updated from 3 to 4\n",
      "\n",
      "query 47\n",
      "num_relation: 2\n",
      "\n",
      "joined tables: category, film_category\n",
      "edge count between category and film_category has been updated from 7 to 8\n",
      "\n",
      "joined tables: film_category, film\n",
      "edge count between film_category and film has been updated from 7 to 8\n",
      "\n",
      "query 48\n",
      "No relation are found\n",
      "\n",
      "query 49\n",
      "num_relation: 4\n",
      "\n",
      "joined tables: store, staff\n",
      "edge count between store and staff has been updated from 2 to 3\n",
      "\n",
      "joined tables: staff, rental\n",
      "edge count between staff and rental has been updated from 1 to 2\n",
      "\n",
      "joined tables: rental, address\n",
      "\n",
      "query 50\n",
      "num_relation: 2\n",
      "\n",
      "joined tables: customer, rental\n",
      "edge count between customer and rental has been updated from 4 to 5\n",
      "\n",
      "joined tables: rental, payment\n",
      "edge count between rental and payment has been updated from 3 to 4\n",
      "\n",
      "query 51\n",
      "num_relation: 2\n",
      "\n",
      "joined tables: category, film_category\n",
      "edge count between category and film_category has been updated from 8 to 9\n",
      "\n",
      "joined tables: film_category, film\n",
      "edge count between film_category and film has been updated from 8 to 9\n",
      "\n",
      "query 52\n",
      "No relation are found\n",
      "\n",
      "query 53\n",
      "num_relation: 1\n",
      "\n",
      "joined tables: address, customer\n",
      "edge count between address and customer has been updated from 2 to 3\n",
      "\n",
      "query 54\n",
      "No relation are found\n",
      "\n",
      "query 55\n",
      "num_relation: 4\n",
      "\n",
      "joined tables: store, address\n",
      "edge count between store and address has been updated from 0 to 1\n",
      "\n",
      "joined tables: address, city\n",
      "edge count between address and city has been updated from 2 to 3\n",
      "\n",
      "joined tables: city, staff\n",
      "\n",
      "query 56\n",
      "num_relation: 2\n",
      "\n",
      "joined tables: category, film_category\n",
      "edge count between category and film_category has been updated from 9 to 10\n",
      "\n",
      "joined tables: film_category, film\n",
      "edge count between film_category and film has been updated from 9 to 10\n",
      "\n",
      "query 57\n",
      "num_relation: 1\n",
      "\n",
      "joined tables: customer, rental\n",
      "edge count between customer and rental has been updated from 5 to 6\n",
      "\n",
      "query 58\n",
      "num_relation: 3\n",
      "\n",
      "joined tables: film, inventory\n",
      "edge count between film and inventory has been updated from 16 to 17\n",
      "\n",
      "joined tables: inventory, rental\n",
      "edge count between inventory and rental has been updated from 23 to 24\n",
      "\n",
      "joined tables: rental, payment\n",
      "edge count between rental and payment has been updated from 4 to 5\n",
      "\n",
      "query 59\n",
      "num_relation: 4\n",
      "\n",
      "joined tables: category, film_category\n",
      "edge count between category and film_category has been updated from 10 to 11\n",
      "\n",
      "joined tables: film_category, film\n",
      "edge count between film_category and film has been updated from 10 to 11\n",
      "\n",
      "joined tables: film, film_actor\n",
      "edge count between film and film_actor has been updated from 4 to 5\n",
      "\n",
      "joined tables: film_actor, actor\n",
      "edge count between film_actor and actor has been updated from 6 to 7\n",
      "\n",
      "query 60\n",
      "num_relation: 3\n",
      "\n",
      "joined tables: country, city\n",
      "edge count between country and city has been updated from 0 to 1\n",
      "\n",
      "joined tables: city, address\n",
      "edge count between city and address has been updated from 3 to 4\n",
      "\n",
      "joined tables: address, customer\n",
      "edge count between address and customer has been updated from 3 to 4\n",
      "\n",
      "query 61\n",
      "num_relation: 1\n",
      "\n",
      "joined tables: rental, payment\n",
      "edge count between rental and payment has been updated from 5 to 6\n",
      "\n",
      "query 62\n",
      "num_relation: 1\n",
      "\n",
      "joined tables: customer, rental\n",
      "edge count between customer and rental has been updated from 6 to 7\n",
      "\n",
      "query 63\n",
      "No relation are found\n",
      "\n",
      "query 64\n",
      "num_relation: 5\n",
      "\n",
      "joined tables: store, staff\n",
      "edge count between store and staff has been updated from 3 to 4\n",
      "\n",
      "joined tables: staff, rental\n",
      "edge count between staff and rental has been updated from 2 to 3\n",
      "\n",
      "joined tables: rental, customer\n",
      "edge count between rental and customer has been updated from 7 to 8\n",
      "\n",
      "joined tables: customer, address\n",
      "edge count between customer and address has been updated from 4 to 5\n",
      "\n",
      "joined tables: address, city\n",
      "edge count between address and city has been updated from 4 to 5\n",
      "\n",
      "query 65\n",
      "num_relation: 2\n",
      "\n",
      "joined tables: category, film_category\n",
      "edge count between category and film_category has been updated from 11 to 12\n",
      "\n",
      "joined tables: film_category, film\n",
      "edge count between film_category and film has been updated from 11 to 12\n",
      "\n",
      "query 66\n",
      "num_relation: 1\n",
      "\n",
      "joined tables: customer, rental\n",
      "edge count between customer and rental has been updated from 8 to 9\n",
      "\n",
      "query 67\n",
      "num_relation: 4\n",
      "\n",
      "joined tables: category, film_category\n",
      "edge count between category and film_category has been updated from 12 to 13\n",
      "\n",
      "joined tables: film_category, film\n",
      "edge count between film_category and film has been updated from 12 to 13\n",
      "\n",
      "joined tables: film, film_actor\n",
      "edge count between film and film_actor has been updated from 5 to 6\n",
      "\n",
      "joined tables: film_actor, actor\n",
      "edge count between film_actor and actor has been updated from 7 to 8\n",
      "\n",
      "query 68\n",
      "num_relation: 2\n",
      "\n",
      "joined tables: customer, rental\n",
      "edge count between customer and rental has been updated from 9 to 10\n",
      "\n",
      "joined tables: rental, payment\n",
      "edge count between rental and payment has been updated from 6 to 7\n",
      "\n",
      "query 69\n",
      "num_relation: 1\n",
      "\n",
      "joined tables: rental, customer\n",
      "edge count between rental and customer has been updated from 10 to 11\n",
      "\n",
      "query 70\n",
      "num_relation: 3\n",
      "\n",
      "joined tables: country, city\n",
      "edge count between country and city has been updated from 1 to 2\n",
      "\n",
      "joined tables: city, address\n",
      "edge count between city and address has been updated from 5 to 6\n",
      "\n",
      "joined tables: address, customer\n",
      "edge count between address and customer has been updated from 5 to 6\n",
      "\n",
      "query 71\n",
      "num_relation: 2\n",
      "\n",
      "joined tables: film, inventory\n",
      "edge count between film and inventory has been updated from 17 to 18\n",
      "\n",
      "joined tables: inventory, rental\n",
      "edge count between inventory and rental has been updated from 24 to 25\n",
      "\n",
      "query 72\n",
      "num_relation: 2\n",
      "\n",
      "joined tables: store, staff\n",
      "edge count between store and staff has been updated from 4 to 5\n",
      "\n",
      "joined tables: staff, rental\n",
      "edge count between staff and rental has been updated from 3 to 4\n",
      "\n",
      "query 73\n",
      "num_relation: 4\n",
      "\n",
      "joined tables: category, film_category\n",
      "edge count between category and film_category has been updated from 13 to 14\n",
      "\n",
      "joined tables: film_category, film\n",
      "edge count between film_category and film has been updated from 13 to 14\n",
      "\n",
      "joined tables: film, film_actor\n",
      "edge count between film and film_actor has been updated from 6 to 7\n",
      "\n",
      "joined tables: film_actor, actor\n",
      "edge count between film_actor and actor has been updated from 8 to 9\n",
      "\n",
      "query 74\n",
      "num_relation: 1\n",
      "\n",
      "joined tables: customer, rental\n",
      "edge count between customer and rental has been updated from 11 to 12\n",
      "\n",
      "query 75\n",
      "num_relation: 2\n",
      "\n",
      "joined tables: category, film_category\n",
      "edge count between category and film_category has been updated from 14 to 15\n",
      "\n",
      "joined tables: film_category, film\n",
      "edge count between film_category and film has been updated from 14 to 15\n",
      "\n",
      "query 76\n",
      "num_relation: 2\n",
      "\n",
      "joined tables: actor, film_actor\n",
      "edge count between actor and film_actor has been updated from 9 to 10\n",
      "\n",
      "joined tables: film_actor, film\n",
      "edge count between film_actor and film has been updated from 7 to 8\n",
      "\n",
      "query 77\n",
      "num_relation: 2\n",
      "\n",
      "joined tables: film, film_actor\n",
      "edge count between film and film_actor has been updated from 8 to 9\n",
      "\n",
      "joined tables: film_actor, actor\n",
      "edge count between film_actor and actor has been updated from 10 to 11\n",
      "\n",
      "query 78\n",
      "num_relation: 2\n",
      "\n",
      "joined tables: customer, rental\n",
      "edge count between customer and rental has been updated from 12 to 13\n",
      "\n",
      "joined tables: rental, staff\n",
      "edge count between rental and staff has been updated from 4 to 5\n",
      "\n",
      "query 79\n",
      "num_relation: 2\n",
      "\n",
      "joined tables: category, film_category\n",
      "edge count between category and film_category has been updated from 15 to 16\n",
      "\n",
      "joined tables: film_category, film\n",
      "edge count between film_category and film has been updated from 15 to 16\n",
      "\n",
      "query 80\n",
      "num_relation: 2\n",
      "\n",
      "joined tables: actor, film_actor\n",
      "edge count between actor and film_actor has been updated from 11 to 12\n",
      "\n",
      "joined tables: film_actor, film\n",
      "edge count between film_actor and film has been updated from 9 to 10\n",
      "\n",
      "query 81\n",
      "num_relation: 2\n",
      "\n",
      "joined tables: category, film_category\n",
      "edge count between category and film_category has been updated from 16 to 17\n",
      "\n",
      "joined tables: film_category, film\n",
      "edge count between film_category and film has been updated from 16 to 17\n",
      "\n",
      "query 82\n",
      "num_relation: 1\n",
      "\n",
      "joined tables: rental, payment\n",
      "edge count between rental and payment has been updated from 7 to 8\n",
      "\n",
      "query 83\n",
      "num_relation: 1\n",
      "\n",
      "joined tables: customer, rental\n",
      "edge count between customer and rental has been updated from 13 to 14\n",
      "\n",
      "query 84\n",
      "num_relation: 2\n",
      "\n",
      "joined tables: city, address\n",
      "edge count between city and address has been updated from 6 to 7\n",
      "\n",
      "joined tables: address, customer\n",
      "edge count between address and customer has been updated from 6 to 7\n",
      "\n",
      "query 85\n",
      "num_relation: 2\n",
      "\n",
      "joined tables: category, film_category\n",
      "edge count between category and film_category has been updated from 17 to 18\n",
      "\n",
      "joined tables: film_category, film\n",
      "edge count between film_category and film has been updated from 17 to 18\n",
      "\n",
      "query 86\n",
      "num_relation: 2\n",
      "\n",
      "joined tables: country, city\n",
      "edge count between country and city has been updated from 2 to 3\n",
      "\n",
      "joined tables: city, address\n",
      "edge count between city and address has been updated from 7 to 8\n",
      "\n",
      "query 87\n",
      "num_relation: 2\n",
      "\n",
      "joined tables: customer, rental\n",
      "edge count between customer and rental has been updated from 14 to 15\n",
      "\n",
      "joined tables: rental, staff\n",
      "edge count between rental and staff has been updated from 5 to 6\n",
      "\n",
      "query 88\n",
      "num_relation: 1\n",
      "\n",
      "joined tables: rental, customer\n",
      "edge count between rental and customer has been updated from 15 to 16\n",
      "\n",
      "query 89\n",
      "num_relation: 4\n",
      "\n",
      "joined tables: category, film_category\n",
      "edge count between category and film_category has been updated from 18 to 19\n",
      "\n",
      "joined tables: film_category, film\n",
      "edge count between film_category and film has been updated from 18 to 19\n",
      "\n",
      "joined tables: film, film_actor\n",
      "edge count between film and film_actor has been updated from 10 to 11\n",
      "\n",
      "joined tables: film_actor, actor\n",
      "edge count between film_actor and actor has been updated from 12 to 13\n",
      "\n",
      "query 90\n",
      "num_relation: 2\n",
      "\n",
      "joined tables: customer, rental\n",
      "edge count between customer and rental has been updated from 16 to 17\n",
      "\n",
      "joined tables: rental, payment\n",
      "edge count between rental and payment has been updated from 8 to 9\n",
      "\n",
      "query 91\n",
      "num_relation: 4\n",
      "\n",
      "joined tables: store, staff\n",
      "edge count between store and staff has been updated from 5 to 6\n",
      "\n",
      "joined tables: staff, rental\n",
      "edge count between staff and rental has been updated from 6 to 7\n",
      "\n",
      "joined tables: rental, inventory\n",
      "edge count between rental and inventory has been updated from 25 to 26\n",
      "\n",
      "joined tables: inventory, film\n",
      "edge count between inventory and film has been updated from 18 to 19\n",
      "\n",
      "query 92\n",
      "num_relation: 3\n",
      "\n",
      "joined tables: customer, rental\n",
      "edge count between customer and rental has been updated from 17 to 18\n",
      "\n",
      "joined tables: rental, inventory\n",
      "edge count between rental and inventory has been updated from 26 to 27\n",
      "\n",
      "joined tables: inventory, film\n",
      "edge count between inventory and film has been updated from 19 to 20\n",
      "\n",
      "query 93\n",
      "num_relation: 2\n",
      "\n",
      "joined tables: city, address\n",
      "edge count between city and address has been updated from 8 to 9\n",
      "\n",
      "joined tables: address, customer\n",
      "edge count between address and customer has been updated from 7 to 8\n",
      "\n",
      "query 94\n",
      "num_relation: 2\n",
      "\n",
      "joined tables: category, film_category\n",
      "edge count between category and film_category has been updated from 19 to 20\n",
      "\n",
      "joined tables: film_category, film\n",
      "edge count between film_category and film has been updated from 19 to 20\n",
      "\n",
      "query 95\n",
      "num_relation: 2\n",
      "\n",
      "joined tables: customer, rental\n",
      "edge count between customer and rental has been updated from 18 to 19\n",
      "\n",
      "joined tables: rental, inventory\n",
      "edge count between rental and inventory has been updated from 27 to 28\n",
      "\n",
      "query 96\n",
      "num_relation: 2\n",
      "\n",
      "joined tables: category, film_category\n",
      "edge count between category and film_category has been updated from 20 to 21\n",
      "\n",
      "joined tables: film_category, film\n",
      "edge count between film_category and film has been updated from 20 to 21\n",
      "\n",
      "query 97\n",
      "num_relation: 2\n",
      "\n",
      "joined tables: actor, film_actor\n",
      "edge count between actor and film_actor has been updated from 13 to 14\n",
      "\n",
      "joined tables: film_actor, film\n",
      "edge count between film_actor and film has been updated from 11 to 12\n",
      "\n",
      "query 98\n",
      "num_relation: 2\n",
      "\n",
      "joined tables: category, film_category\n",
      "edge count between category and film_category has been updated from 21 to 22\n",
      "\n",
      "joined tables: film_category, film\n",
      "edge count between film_category and film has been updated from 21 to 22\n",
      "\n",
      "query 99\n",
      "num_relation: 2\n",
      "\n",
      "joined tables: actor, film_actor\n",
      "edge count between actor and film_actor has been updated from 14 to 15\n",
      "\n",
      "joined tables: film_actor, film\n",
      "edge count between film_actor and film has been updated from 12 to 13\n",
      "\n",
      "query 100\n",
      "num_relation: 3\n",
      "\n",
      "joined tables: customer, rental\n",
      "edge count between customer and rental has been updated from 19 to 20\n",
      "\n",
      "joined tables: rental, staff\n",
      "edge count between rental and staff has been updated from 7 to 8\n",
      "\n",
      "joined tables: staff, address\n",
      "edge count between staff and address has been updated from 0 to 1\n"
     ]
    }
   ],
   "source": [
    "for n, cooc_table in enumerate(cooc_tables):\n",
    "    print(f'\\nquery {n}')\n",
    "    cooc_table_len = len(cooc_table)\n",
    "    try:\n",
    "        if cooc_table_len <= 1:\n",
    "            print('No relation are found')\n",
    "            continue\n",
    "        else:\n",
    "            num_rel = cooc_table_len-1\n",
    "            print(f'num_relation: {num_rel}')\n",
    "            range_num_rel = range(num_rel)\n",
    "            for idx in range_num_rel:\n",
    "                table1, table2 = cooc_table[idx], cooc_table[idx+1]\n",
    "                print(f'\\njoined tables: {table1}, {table2}')\n",
    "                update_edge_count(table1, table2)\n",
    "    except IndexError:\n",
    "        continue"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 134,
   "id": "1b884de0-1cb7-4362-b92d-08d854de8918",
   "metadata": {},
   "outputs": [],
   "source": [
    "cursor.execute(f\"\"\"\n",
    "                SET search_path TO ag_catalog;\n",
    "                \"\"\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 93,
   "id": "9a39eff5-a3aa-48b9-a184-b14005116fb5",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "3"
      ]
     },
     "execution_count": 93,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "cursor.execute(\"\"\"\n",
    "                  SELECT * FROM cypher('graph_v2',$$\n",
    "                  MATCH (v1:table {table_name:'rental'})-[r]->(v2:table {table_name:'inventory'}) \n",
    "                  RETURN r.count \n",
    "                  $$) as (count agtype);\n",
    "                \"\"\")\n",
    "output = int(cursor.fetchall()[0]['count'])\n",
    "output"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 91,
   "id": "1b3b76e7-3106-4eb6-817f-27ca193ed512",
   "metadata": {},
   "outputs": [
    {
     "ename": "IndexError",
     "evalue": "list index out of range",
     "output_type": "error",
     "traceback": [
      "\u001b[0;31m---------------------------------------------------------------------------\u001b[0m",
      "\u001b[0;31mIndexError\u001b[0m                                Traceback (most recent call last)",
      "Cell \u001b[0;32mIn[91], line 8\u001b[0m\n\u001b[1;32m      1\u001b[0m cursor\u001b[38;5;241m.\u001b[39mexecute(\u001b[38;5;124m\"\"\"\u001b[39m\n\u001b[1;32m      2\u001b[0m \u001b[38;5;124m                  SELECT * FROM cypher(\u001b[39m\u001b[38;5;124m'\u001b[39m\u001b[38;5;124mgraph_v2\u001b[39m\u001b[38;5;124m'\u001b[39m\u001b[38;5;124m,$$\u001b[39m\n\u001b[1;32m      3\u001b[0m \u001b[38;5;124m                  MATCH (v1:table \u001b[39m\u001b[38;5;124m{\u001b[39m\u001b[38;5;124mtable_name:\u001b[39m\u001b[38;5;124m'\u001b[39m\u001b[38;5;124mrental\u001b[39m\u001b[38;5;124m'\u001b[39m\u001b[38;5;124m})<-[r:ref]-(v2:table \u001b[39m\u001b[38;5;124m{\u001b[39m\u001b[38;5;124mtable_name:\u001b[39m\u001b[38;5;124m'\u001b[39m\u001b[38;5;124minventory\u001b[39m\u001b[38;5;124m'\u001b[39m\u001b[38;5;124m}) \u001b[39m\n\u001b[0;32m   (...)\u001b[0m\n\u001b[1;32m      6\u001b[0m \u001b[38;5;124m                  $$) as (count agtype);\u001b[39m\n\u001b[1;32m      7\u001b[0m \u001b[38;5;124m                \u001b[39m\u001b[38;5;124m\"\"\"\u001b[39m)\n\u001b[0;32m----> 8\u001b[0m output \u001b[38;5;241m=\u001b[39m \u001b[38;5;28mint\u001b[39m(\u001b[43mcursor\u001b[49m\u001b[38;5;241;43m.\u001b[39;49m\u001b[43mfetchall\u001b[49m\u001b[43m(\u001b[49m\u001b[43m)\u001b[49m\u001b[43m[\u001b[49m\u001b[38;5;241;43m0\u001b[39;49m\u001b[43m]\u001b[49m[\u001b[38;5;124m'\u001b[39m\u001b[38;5;124mcount\u001b[39m\u001b[38;5;124m'\u001b[39m])\n\u001b[1;32m      9\u001b[0m output\n",
      "\u001b[0;31mIndexError\u001b[0m: list index out of range"
     ]
    }
   ],
   "source": [
    "cursor.execute(\"\"\"\n",
    "                  SELECT * FROM cypher('graph_v2',$$\n",
    "                  MATCH (v1:table {table_name:'rental'})<-[r:ref]-(v2:table {table_name:'inventory'}) \n",
    "                  SET r.count = 13\n",
    "                  RETURN r.count \n",
    "                  $$) as (count agtype);\n",
    "                \"\"\")\n",
    "output = int(cursor.fetchall()[0]['count'])\n",
    "output"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 114,
   "id": "107f6adb-e366-47bc-a593-c7832384f1ed",
   "metadata": {},
   "outputs": [],
   "source": [
    "def update_edge_count(table1, table2):\n",
    "    cursor.execute(f\"\"\"\n",
    "                  SELECT * FROM cypher('graph_v2',$$\n",
    "                  MATCH (v1:table {{ table_name:'{table1}' }})-[r]-(v2:table {{ table_name:'{table2}' }}) \n",
    "                  RETURN r.count\n",
    "                  $$) as (count agtype);\n",
    "                  \"\"\")\n",
    "    old_count = int(cursor.fetchall()[0]['count'])\n",
    "    updated_count = old_count + 1\n",
    "    cursor.execute(f\"\"\"\n",
    "                  SELECT * FROM cypher('graph_v2',$$\n",
    "                  MATCH (v1:table {{ table_name:'{table1}' }})-[r]-(v2:table {{ table_name:'{table2}' }})\n",
    "                  SET r.count = {updated_count}\n",
    "                  RETURN r.count \n",
    "                  $$) as (count agtype);\n",
    "                  \"\"\")\n",
    "    updated_check = int(cursor.fetchall()[0]['count'])\n",
    "    print(f'  edge count between {table1} and {table2} has been updated from {old_count} to {updated_count}')"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 83,
   "id": "ccabab5f-e76e-4d94-8789-795707e979f8",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "edge count between city and address has been updated from 15 to 16\n"
     ]
    }
   ],
   "source": [
    "update_edge_count('city', 'address')"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "7217153a-2d86-45b7-b990-754fa7ff19fe",
   "metadata": {},
   "outputs": [],
   "source": [
    "SELECT * FROM cypher('graph_v2',$$\n",
    "MATCH (v1:table)<-[r:fkey]-(v2:table) \n",
    "RETURN r.count \n",
    "$$) as (count agtype);"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "70c68dbf-78ee-45c9-80c2-436a8a366596",
   "metadata": {},
   "outputs": [],
   "source": [
    "# def update_edge_count(table1, table2):\n",
    "#     cursor.execute(f\"\"\"\n",
    "#                   SELECT * FROM cypher('graph_v2',$$\n",
    "#                   MATCH (v1:table {{ table_name:'{table1}' }})-[r]-(v2:table {{ table_name:'{table2}' }}) \n",
    "#                   RETURN r.count\n",
    "#                   $$) as (count agtype);\n",
    "#                   \"\"\")\n",
    "#     old_count = int(cursor.fetchall()[0]['count'])\n",
    "#     updated_count = old_count + 1\n",
    "#     cursor.execute(f\"\"\"\n",
    "#                   SELECT * FROM cypher('graph_v2',$$\n",
    "#                   MATCH (v1:table {{ table_name:'{table1}' }})-[r]-(v2:table {{ table_name:'{table2}' }})\n",
    "#                   SET r.count = {updated_count}\n",
    "#                   RETURN r.count \n",
    "#                   $$) as (count agtype);\n",
    "#                   \"\"\")\n",
    "#     updated_check = int(cursor.fetchall()[0]['count'])\n",
    "#     print(f'edge count between {table1} and {table2} has been updated from {old_count} to {updated_count}')"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3 (ipykernel)",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.10.13"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
